Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 2500, 1)]         0         
_________________________________________________________________
conv1d (Conv1D)              (None, 2498, 6)           24        
_________________________________________________________________
flatten_1 (Flatten)          (None, 14988)             0         
_________________________________________________________________
dense (Dense)                (None, 2)                 29978     
=================================================================
Total params: 30,002
Trainable params: 30,002
Non-trainable params: 0
_________________________________________________________________